### Production environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=ffab38df-cddf-433f-859a-6cfa161a5ceb-6380c778-7078-4cf9-86bd-5a6371b1c2c9-40a08517-ff80-4b40-b4e2-7c167a17825d]
data.cloudflare_zone.main: Read complete after 1s [id=196a92a2c10bfc2ffd05d0063a5f51b7]
data.azurerm_client_config.current: Reading...
data.azurerm_container_registry.main: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02MzgwYzc3OC03MDc4LTRjZjktODZiZC01YTYzNzFiMWMyYzk7b2JqZWN0SWQ9NDBhMDg1MTctZmY4MC00YjQwLWI0ZTItN2MxNjdhMTc4MjVkO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
azurerm_user_assigned_identity.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-tshort-prod-westeurope-001]
azurerm_static_web_app.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-prod-001]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.OperationalInsights/workspaces/log-tshort-prod-westeurope-001]
azurerm_application_insights.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Insights/components/appi-tshort-prod-westeurope-001]
data.azurerm_container_registry.main: Read complete after 1s [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001]
azurerm_role_assignment.api_acr_pull: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001/providers/Microsoft.Authorization/roleAssignments/37f5c059-42ad-4cd0-5949-568971bff5b6]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-prod-westeurope-001]
azurerm_container_app.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001]
cloudflare_record.primary: Refreshing state... [id=4ae81ada11d0508bdf9e7124832420ff]
time_sleep.wait_for_dns_record: Refreshing state... [id=2025-01-03T00:03:27Z]
azurerm_static_web_app_custom_domain.primary: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-prod-001/customDomains/admin.tshort.me]
cloudflare_record.api: Refreshing state... [id=fff7ce9dd7dcb41ffc3e2f595667d5a8]
cloudflare_record.asuid_api: Refreshing state... [id=3f473b3261a71bc41a22332566f3e49c]
time_sleep.api_custom_domain_records: Refreshing state... [id=2025-01-03T17:58:06Z]
azurerm_container_app_custom_domain.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001/customDomainName/tshort.me]
azapi_resource_action.destroy_custom_domain_binding: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001]
azapi_resource.managed_certificate: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-prod-westeurope-001/managedCertificates/aca-tshort-api-prod-001]
azapi_resource_action.apply_custom_domain_binding: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azapi_resource.sql_database will be created
  + resource "azapi_resource" "sql_database" {
      + body                      = {
          + properties = {
              + autoPauseDelay                   = 15
              + availabilityZone                 = "NoPreference"
              + freeLimitExhaustionBehavior      = "BillOverUsage"
              + isLedgerOn                       = false
              + maxSizeBytes                     = 34359738368
              + minCapacity                      = 0.5
              + readScale                        = "Disabled"
              + requestedBackupStorageRedundancy = "Local"
              + useFreeLimit                     = true
              + zoneRedundant                    = false
            }
          + sku        = {
              + capacity = 2
              + family   = "Gen5"
              + name     = "GP_S_Gen5"
              + tier     = "GeneralPurpose"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "westeurope"
      + name                      = "sqldb-001"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "*",
        ]
      + schema_validation_enabled = false
      + type                      = "Microsoft.Sql/servers/databases@2023-08-01-preview"
    }

  # azuread_group.sql_server_admins will be created
  + resource "azuread_group" "sql_server_admins" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "SQL Server Admins for Server sql-tshort-prod-westeurope-001"
      + display_name                   = "SQL-Admins-sql-tshort-prod-westeurope-001"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = [
          + "40a08517-ff80-4b40-b4e2-7c167a17825d",
          + "b7171752-9174-4430-be20-a049563d8105",
        ]
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = [
          + "40a08517-ff80-4b40-b4e2-7c167a17825d",
        ]
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azurerm_container_app.api will be updated in-place
  ~ resource "azurerm_container_app" "api" {
        id                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001"
        name                          = "aca-tshort-api-prod-001"
        tags                          = {
            "environment" = "Production"
            "managed-by"  = "Terraform"
            "project"     = "TShort"
        }
        # (10 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "crtshortwesteurope001.azurecr.io/tshort-api:0.1.0-alpha.3" -> "crtshortwesteurope001.azurecr.io/placeholder"
                name              = "tshort-api"
                # (5 unchanged attributes hidden)

              + env {
                  + name  = "ConnectionStrings__tshort"
                  + value = (known after apply)
                }

                # (1 unchanged block hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                  = (known after apply)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "westeurope"
      + minimum_tls_version                  = "1.2"
      + name                                 = "sql-tshort-prod-westeurope-001"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "rg-tshort-prod-westeurope-001"
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + version                              = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = true
          + login_username              = "SQL-Admins-sql-tshort-prod-westeurope-001"
          + object_id                   = (known after apply)
          + tenant_id                   = (known after apply)
        }
    }

  # time_sleep.group_provisioning will be created
  + resource "time_sleep" "group_provisioning" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "display_name" = "SQL-Admins-sql-tshort-prod-westeurope-001"
          + "object_id"    = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + connection_string   = (known after apply)
  + sql_server_database = "sqldb-001"
  + sql_server_fqdn     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>